In [136]:
import pandas as pd
import numpy as np

In [137]:
labels = ['a', 'b', 'c']
minha_lista = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

## Series

In [138]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [139]:
"""
indice 0    a
indice 1    b
indice 2    c
dtype: object
"""
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [140]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [141]:
ser1 = pd.Series(data=[1,2,3,4], index=['EUA','ALEMANHA','URSS','JAPAO'])

In [142]:
ser2 = pd.Series(data=[1,2,5,4], index=['EUA','ALEMANHA','ITALIA','JAPAO'])

In [143]:
ser1

EUA         1
ALEMANHA    2
URSS        3
JAPAO       4
dtype: int64

In [144]:
ser2

EUA         1
ALEMANHA    2
ITALIA      5
JAPAO       4
dtype: int64

In [145]:
ser1['EUA']

1

In [146]:
ser1['ALEMANHA']

2

In [147]:
ser1[['EUA','ALEMANHA']] # paaa acessar multiplos indices [] lista, string para um indice

EUA         1
ALEMANHA    2
dtype: int64

In [148]:
ser1['URSS'] = 3

In [149]:
ser1

EUA         1
ALEMANHA    2
URSS        3
JAPAO       4
dtype: int64

In [150]:
ser1 + ser2 # operacoes no pandas sao orientadas por index

ALEMANHA    4.0
EUA         2.0
ITALIA      NaN
JAPAO       8.0
URSS        NaN
dtype: float64

In [151]:
#=========================================================================================

## DataFrame

In [152]:
from numpy.random import randn

In [153]:
df = pd.DataFrame(randn(5,4), index=['A','B','C','D','E'], columns="W X Y Z".split())

In [154]:
df

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116
E  0.506802  0.996273 -1.186899 -0.069892

In [155]:
type(df)

pandas.core.frame.DataFrame

In [156]:
df['W'] # Selecionar un Serie use o index para DataFrame use a coluna

A   -0.413937
B   -0.685759
C   -0.240187
D    1.921992
E    0.506802
Name: W, dtype: float64

In [157]:
type(df['W'])

pandas.core.series.Series

In [158]:
df[['W']] # DataFrame com uma coluna

          W
A -0.413937
B -0.685759
C -0.240187
D  1.921992
E  0.506802

In [159]:
type(df[['W']])

pandas.core.frame.DataFrame

In [160]:
df['new'] = df['W']

In [161]:
df

          W         X         Y         Z       new
A -0.413937  1.016877  0.167157  0.205113 -0.413937
B -0.685759  1.027940 -1.415874 -0.616931 -0.685759
C -0.240187 -0.511842  1.476749 -1.281464 -0.240187
D  1.921992  0.183969 -0.665544 -0.669116  1.921992
E  0.506802  0.996273 -1.186899 -0.069892  0.506802

In [162]:
df['new'] = df['W'] + df['Y']

In [163]:
df

          W         X         Y         Z       new
A -0.413937  1.016877  0.167157  0.205113 -0.246780
B -0.685759  1.027940 -1.415874 -0.616931 -2.101632
C -0.240187 -0.511842  1.476749 -1.281464  1.236562
D  1.921992  0.183969 -0.665544 -0.669116  1.256448
E  0.506802  0.996273 -1.186899 -0.069892 -0.680097

In [164]:
del df['new']

In [165]:
df

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116
E  0.506802  0.996273 -1.186899 -0.069892

In [166]:
df['new'] = df['W'] + df['Y']

In [167]:
df.drop('new', axis=1) # axis=1 para coluna axis=0 para linha

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116
E  0.506802  0.996273 -1.186899 -0.069892

In [168]:
df

          W         X         Y         Z       new
A -0.413937  1.016877  0.167157  0.205113 -0.246780
B -0.685759  1.027940 -1.415874 -0.616931 -2.101632
C -0.240187 -0.511842  1.476749 -1.281464  1.236562
D  1.921992  0.183969 -0.665544 -0.669116  1.256448
E  0.506802  0.996273 -1.186899 -0.069892 -0.680097

In [169]:
df.drop('new', axis=1, inplace=True) # Deletando do df original

In [170]:
df

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116
E  0.506802  0.996273 -1.186899 -0.069892

In [171]:
#=========================================================================================

## loc & iloc

In [172]:
df.loc['A'] # devolve uma transposicao

W   -0.413937
X    1.016877
Y    0.167157
Z    0.205113
Name: A, dtype: float64

In [173]:
df.loc[['A','B']]

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931

In [174]:
df.iloc[0,1] # trabalhar com valores de forma numerica passando indice da coluna e indice da linha

1.0168766863817413

In [175]:
df.iloc[0,0]

-0.41393709505169984

In [176]:
df.loc[['A','B'], 'W']

A   -0.413937
B   -0.685759
Name: W, dtype: float64

In [177]:
df.loc[['A','B'], ['W']]

          W
A -0.413937
B -0.685759

In [178]:
df

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116
E  0.506802  0.996273 -1.186899 -0.069892

In [179]:
df.iloc[:4]

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116

In [180]:
df.iloc[:-1,:]

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116

In [181]:
df.iloc[:-1,:3]

          W         X         Y
A -0.413937  1.016877  0.167157
B -0.685759  1.027940 -1.415874
C -0.240187 -0.511842  1.476749
D  1.921992  0.183969 -0.665544

In [182]:
df.iloc[1:4,1:3]

          X         Y
B  1.027940 -1.415874
C -0.511842  1.476749
D  0.183969 -0.665544

In [183]:
df + df

          W         X         Y         Z
A -0.827874  2.033753  0.334315  0.410227
B -1.371517  2.055880 -2.831747 -1.233862
C -0.480373 -1.023684  2.953498 -2.562928
D  3.843984  0.367938 -1.331088 -1.338232
E  1.013605  1.992547 -2.373798 -0.139784

In [184]:
df > 0

       W      X      Y      Z
A  False   True   True   True
B  False   True  False  False
C  False  False   True  False
D   True   True  False  False
E   True   True  False  False

In [185]:
df

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
B -0.685759  1.027940 -1.415874 -0.616931
C -0.240187 -0.511842  1.476749 -1.281464
D  1.921992  0.183969 -0.665544 -0.669116
E  0.506802  0.996273 -1.186899 -0.069892

In [186]:
df[df > 0]

          W         X         Y         Z
A       NaN  1.016877  0.167157  0.205113
B       NaN  1.027940       NaN       NaN
C       NaN       NaN  1.476749       NaN
D  1.921992  0.183969       NaN       NaN
E  0.506802  0.996273       NaN       NaN

In [187]:
df['Z'] > 0

A     True
B    False
C    False
D    False
E    False
Name: Z, dtype: bool

In [188]:
df['Y'] > 0

A     True
B    False
C     True
D    False
E    False
Name: Y, dtype: bool

In [189]:
df[df['Y'] > 0]

          W         X         Y         Z
A -0.413937  1.016877  0.167157  0.205113
C -0.240187 -0.511842  1.476749 -1.281464

In [190]:
df[(df['Y'] > 0) & (df['W'] > 0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [191]:
#=========================================================================================

## Mais detalhes do ndice

In [192]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [193]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [194]:
df.reset_index(inplace=True)

In [195]:
df

  index         W         X         Y         Z
0     A -0.413937  1.016877  0.167157  0.205113
1     B -0.685759  1.027940 -1.415874 -0.616931
2     C -0.240187 -0.511842  1.476749 -1.281464
3     D  1.921992  0.183969 -0.665544 -0.669116
4     E  0.506802  0.996273 -1.186899 -0.069892

In [196]:
df.set_index("index")

              W         X         Y         Z
index
A     -0.413937  1.016877  0.167157  0.205113
B     -0.685759  1.027940 -1.415874 -0.616931
C     -0.240187 -0.511842  1.476749 -1.281464
D      1.921992  0.183969 -0.665544 -0.669116
E      0.506802  0.996273 -1.186899 -0.069892

In [197]:
df.set_index("index", inplace=True)

In [198]:
df

              W         X         Y         Z
index
A     -0.413937  1.016877  0.167157  0.205113
B     -0.685759  1.027940 -1.415874 -0.616931
C     -0.240187 -0.511842  1.476749 -1.281464
D      1.921992  0.183969 -0.665544 -0.669116
E      0.506802  0.996273 -1.186899 -0.069892

In [199]:
novoid = "CA NY WY CA CO".split()

In [200]:
df["novo_index"] = novoid

In [201]:
df

              W         X         Y         Z novo_index
index
A     -0.413937  1.016877  0.167157  0.205113         CA
B     -0.685759  1.027940 -1.415874 -0.616931         NY
C     -0.240187 -0.511842  1.476749 -1.281464         WY
D      1.921992  0.183969 -0.665544 -0.669116         CA
E      0.506802  0.996273 -1.186899 -0.069892         CO

In [202]:
df.set_index("novo_index")

                   W         X         Y         Z
novo_index
CA         -0.413937  1.016877  0.167157  0.205113
NY         -0.685759  1.027940 -1.415874 -0.616931
WY         -0.240187 -0.511842  1.476749 -1.281464
CA          1.921992  0.183969 -0.665544 -0.669116
CO          0.506802  0.996273 -1.186899 -0.069892

In [203]:
df.reset_index().set_index("novo_index")

           index         W         X         Y         Z
novo_index
CA             A -0.413937  1.016877  0.167157  0.205113
NY             B -0.685759  1.027940 -1.415874 -0.616931
WY             C -0.240187 -0.511842  1.476749 -1.281464
CA             D  1.921992  0.183969 -0.665544 -0.669116
CO             E  0.506802  0.996273 -1.186899 -0.069892

In [204]:
#=========================================================================================

## Hierarquia de ndices e ndices mltiplos

In [205]:
# nveis de ndice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

In [206]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [207]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [208]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [209]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [210]:
df

             A         B
G1 1  0.639861  0.815595
   2 -0.886413  0.670101
   3 -0.994889  1.855199
G2 1 -1.957884 -1.264673
   2  1.705062  0.641455
   3 -1.268968  0.039591

In [211]:
df.loc["G1"]

          A         B
1  0.639861  0.815595
2 -0.886413  0.670101
3 -0.994889  1.855199

In [212]:
df.loc["G1"].loc[1]

A    0.639861
B    0.815595
Name: 1, dtype: float64

In [213]:
df.loc["G2"].loc[1]

A   -1.957884
B   -1.264673
Name: 1, dtype: float64

In [214]:
df.index.names

FrozenList([None, None])

In [215]:
df.index.names = ["Grupo","Numero"]

In [216]:
df

                     A         B
Grupo Numero
G1    1       0.639861  0.815595
      2      -0.886413  0.670101
      3      -0.994889  1.855199
G2    1      -1.957884 -1.264673
      2       1.705062  0.641455
      3      -1.268968  0.039591

In [217]:
df.xs(1, level='Numero')

              A         B
Grupo
G1     0.639861  0.815595
G2    -1.957884 -1.264673

In [218]:
#=========================================================================================

## Manipulao de dados ausentes

In [219]:
df = pd.DataFrame({'A': [1,2,np.nan], 'B': [5,np.nan, np.nan], 'C': [1,2,3]})

In [220]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [221]:
df.dropna(axis=0)      # joga fora o NaN

     A    B  C
0  1.0  5.0  1

In [222]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [223]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [224]:
df.fillna(0) # preencher dados onde encontrar Nan

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [225]:
df.fillna('Null')

      A     B  C
0   1.0   5.0  1
1   2.0  Null  2
2  Null  Null  3

In [226]:
df["A"].fillna(value=df["A"].mean()) # subistituir valor com a mdia para que no prejudique a distribuio amostral

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [227]:
df.ffill() # substitui pelo ultimo registro a cima

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [228]:
df.bfill() # Substitui pelo ultimo registo a baixo

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [229]:
#=========================================================================================

## Groupby

In [230]:
data = {'Classe': ['Jnior', 'Jnior', 'Pleno', 'Pleno', 'Snior', 'Snior'], 'Nome': ['Jorge', 'Vera', 'Carlos', 'Roberta', 'Patricia', 'Amanda'], 'Venda': [200,120,300,600,400,360]}

In [231]:
df = pd.DataFrame(data)

In [232]:
df

   Classe      Nome  Venda
0  Jnior     Jorge    200
1  Jnior      Vera    120
2   Pleno    Carlos    300
3   Pleno   Roberta    600
4  Snior  Patricia    400
5  Snior    Amanda    360

In [233]:
# Media de vendas por espertize do vendedor

In [234]:
df.groupby("Classe")

In [235]:
group = df.groupby("Classe")

In [236]:
group.sum()

                  Nome  Venda
Classe
Jnior       JorgeVera    320
Pleno    CarlosRoberta    900
Snior  PatriciaAmanda    760

In [237]:
group.mean("Venda")

        Venda
Classe
Jnior  160.0
Pleno   450.0
Snior  380.0

In [238]:
df.groupby("Classe").min()

          Nome  Venda
Classe
Jnior   Jorge    120
Pleno   Carlos    300
Snior  Amanda    360

In [239]:
df.groupby("Classe").max()

            Nome  Venda
Classe
Jnior      Vera    200
Pleno    Roberta    600
Snior  Patricia    400

In [240]:
df2 = df.copy()

In [241]:
df2

   Classe      Nome  Venda
0  Jnior     Jorge    200
1  Jnior      Vera    120
2   Pleno    Carlos    300
3   Pleno   Roberta    600
4  Snior  Patricia    400
5  Snior    Amanda    360

In [242]:
df2["Venda"] = [150, 432, 190, 230, 410, 155]

In [243]:
df2

   Classe      Nome  Venda
0  Jnior     Jorge    150
1  Jnior      Vera    432
2   Pleno    Carlos    190
3   Pleno   Roberta    230
4  Snior  Patricia    410
5  Snior    Amanda    155

In [244]:
df

   Classe      Nome  Venda
0  Jnior     Jorge    200
1  Jnior      Vera    120
2   Pleno    Carlos    300
3   Pleno   Roberta    600
4  Snior  Patricia    400
5  Snior    Amanda    360

In [245]:
df3 = pd.concat([df, df2])

In [246]:
df3

   Classe      Nome  Venda
0  Jnior     Jorge    200
1  Jnior      Vera    120
2   Pleno    Carlos    300
3   Pleno   Roberta    600
4  Snior  Patricia    400
5  Snior    Amanda    360
0  Jnior     Jorge    150
1  Jnior      Vera    432
2   Pleno    Carlos    190
3   Pleno   Roberta    230
4  Snior  Patricia    410
5  Snior    Amanda    155

In [247]:
df3.groupby(["Classe", "Nome"])

In [248]:
df3.groupby(["Classe","Nome"]).sum()

                 Venda
Classe Nome
Jnior Jorge       350
       Vera        552
Pleno  Carlos      490
       Roberta     830
Snior Amanda      515
       Patricia    810

In [249]:
#=========================================================================================

## Merge, concat e join

In [250]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [251]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [252]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [253]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [254]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [255]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenao

Concatenao basicamente cola DataFrames. Tenha em mente que as dimenses devem corresponder ao longo do eixo que voc est concatenando. Voc pode usar ** pd.concat ** e passar uma lista de DataFrames para concatenar juntos:

In [256]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [257]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [258]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [259]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [260]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [261]:
pd.merge(esquerda, direita)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [262]:
pd.merge(esquerda, direita, on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [263]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [264]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [265]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [266]:
pd.merge(esquerda, direita, on=["key1","key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [267]:
pd.merge(esquerda, direita, how="outer", on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [268]:
pd.merge(esquerda, direita, how="right", on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [269]:
pd.merge(esquerda, direita, how="left", on=["key1","key2"])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Join

In [270]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [271]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [272]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [273]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [274]:
esquerda.join(direita, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operaes

In [275]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [276]:
df.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [277]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [279]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

In [280]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [281]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [282]:
df['col2'].unique()

array([444, 555, 666])

In [283]:
df['col2'].nunique()

3

In [284]:
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [285]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [286]:
def comp(x):
    return x ** 2 + 3

In [287]:
df["col1"].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [288]:
comp

In [289]:
df["col_calc"] = df["col1"].apply(comp)

In [290]:
df

   col1  col2 col3  col_calc
0     1   444  abc         4
1     2   555  def         7
2     3   666  ghi        12
3     4   444  xyz        19

In [291]:
df["col1"].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [292]:
df["col1"].sum()

10

In [293]:
df["col1"].mean()

2.5

In [294]:
df["col1"].product()

24

In [295]:
df["col1"].std()

1.2909944487358056

In [296]:
df["col1"].max()

4

In [297]:
df["col2"].min()

444

In [298]:
df["col1"].idxmax()

3

In [299]:
df["col1"].idxmin()

0

In [300]:
df

   col1  col2 col3  col_calc
0     1   444  abc         4
1     2   555  def         7
2     3   666  ghi        12
3     4   444  xyz        19

In [301]:
df[df["col2"]==444]["col1"].sum()

5

In [304]:
df[df["col2"] == 444]

   col1  col2 col3  col_calc
0     1   444  abc         4
3     4   444  xyz        19

In [305]:
df.sort_values(by="col2")

   col1  col2 col3  col_calc
0     1   444  abc         4
3     4   444  xyz        19
1     2   555  def         7
2     3   666  ghi        12

In [306]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [307]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [308]:
dict_map = {"one":"1", "two":"2"}

In [309]:
df["B"].map(dict_map)

0    1
1    1
2    2
3    2
4    1
5    1
Name: B, dtype: object

In [313]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [314]:
df["E"] = df["B"].map(dict_map)

In [315]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [318]:
df.pivot_table(index="A", columns="B", values="D")

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

# Dados temporais

In [319]:
import pandas as pd

In [320]:
numero_de_dias = 100
datas = pd.date_range(start='1/1/2021', periods=numero_de_dias)

In [321]:
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [322]:
df = pd.DataFrame(range(numero_de_dias), columns=["number"], index=datas)

In [323]:
df

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
...            ...
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

[100 rows x 1 columns]

In [324]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [325]:
df.index[0]

Timestamp('2021-01-01 00:00:00')

In [326]:
df.index[99]

Timestamp('2021-04-10 00:00:00')

In [327]:
df.index[0].day

1

In [328]:
df.index[99].month

4

In [329]:
df.index[0].year

2021

In [330]:
df.index[10].hour

0

In [331]:
df[df.index.month == 1]

            number
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
2021-01-06       5
2021-01-07       6
2021-01-08       7
2021-01-09       8
2021-01-10       9
2021-01-11      10
2021-01-12      11
2021-01-13      12
2021-01-14      13
2021-01-15      14
2021-01-16      15
2021-01-17      16
2021-01-18      17
2021-01-19      18
2021-01-20      19
2021-01-21      20
2021-01-22      21
2021-01-23      22
2021-01-24      23
2021-01-25      24
2021-01-26      25
2021-01-27      26
2021-01-28      27
2021-01-29      28
2021-01-30      29
2021-01-31      30

In [332]:
df[df.index.month == 4]

            number
2021-04-01      90
2021-04-02      91
2021-04-03      92
2021-04-04      93
2021-04-05      94
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

In [333]:
df[df.index.day == 10]

            number
2021-01-10       9
2021-02-10      40
2021-03-10      68
2021-04-10      99

In [334]:
df["Month"] = df.index.month

In [335]:
df

            number  Month
2021-01-01       0      1
2021-01-02       1      1
2021-01-03       2      1
2021-01-04       3      1
2021-01-05       4      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[100 rows x 2 columns]

In [336]:
import datetime

In [339]:
df[df.index > datetime.datetime(2021, 1, 10)]

            number  Month
2021-01-11      10      1
2021-01-12      11      1
2021-01-13      12      1
2021-01-14      13      1
2021-01-15      14      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[90 rows x 2 columns]

# Entrada e sada de dados

In [340]:
import pandas as pd

In [343]:
df1 = pd.read_csv("data/exemplo.csv", sep=",", decimal=".")

In [344]:
df1

          0         1         2         3
0 -0.394813 -0.694630  0.253393  0.602590
1 -2.134217  1.141381 -0.130142  0.690936
2 -0.223754  0.365133 -0.104233 -0.182788
3  0.108066  0.331332  0.053708 -0.280468
4  0.085290  0.740834 -0.596941  0.243950

In [345]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      float64
 1   1       5 non-null      float64
 2   2       5 non-null      float64
 3   3       5 non-null      float64
dtypes: float64(4)
memory usage: 292.0 bytes

In [346]:
df1.to_csv("output.csv", sep=";", decimal=",")